app/views/articles/_form.html.erb

                    <div class="col-xl-8" >
                        <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>
---
SELECT "categories".* FROM "categories"