app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at") VALUES (?, ?, ?)  [["title", "Latest Article"], ["description", "This article was created just now."], ["created_at", "2019-04-08 16:10:14.396315"]]
---
    def create
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save

UPDATE "articles" SET "description" = ? WHERE "articles"."id" = ?  [["description", "plmkoijnbhuzgvcftrdxffff"], ["id", 24]]
---
    def update
        if !@article.user
            @article.user = User.first
        end
        if @article.update(article_params)