app/controllers/users_controller.rb

    def index
        #@users = User.all
        @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "Jiya"], ["email", "jiya@exe.com"], ["created_at", "2019-04-17 09:42:43.276819"], ["password_digest", "$2a$10$woX.5GgquvZQ3pFjzfKyR.XPKulbmOTCsNy5ef5ZYxRm2cgs7e2mW"]]

    def update
        if @user.update(user_params)
---
UPDATE "users" SET "username" = ? WHERE "users"."id" = ?  [["username", "kkp274"], ["id", 2]]

    def show
        @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]