app/views/layouts/_navigation.html.erb

            <div class="dropdown-divider"></div>
            <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"